dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/SPI2_1.0.xml
        </group>
    <group id="SPI2_DMA_TRIG_RX" name="SPI2_DMA_TRIG_RX" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="SPI2_DMA_TRIG_RX_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RTOUT_EVT" value="0x3" description="SPI receive time-out interrupt"/>
                <bitenum id="RX_EVT" value="0x4" description="Receive Event/interrupt pending"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_RX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RX" description="Receive FIFO event mask." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_RX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RX" description="Receive FIFO event.This interrupt is set if the selected Receive FIFO level has been reached" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out Event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_RX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RX" description="Receive FIFO event mask." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_RX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RX" description="Set Receive FIFO event." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTOUT" description="Set SPI Receive Time-Out event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_RX_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="RX" description="Clear Receive FIFO event." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RTOUT" description="Clear SPI Receive Time-Out event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        </group>
    <group id="SPI2_DMA_TRIG_TX" name="SPI2_DMA_TRIG_TX" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="SPI2_DMA_TRIG_TX_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="TX_EVT" value="0x5" description="Transmit Event/interrupt pending"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_TX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TX" description="Transmit FIFO event mask." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_TX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TX" description="Transmit FIFO event:
A read returns the current mask for transmit FIFO interrupt. On a write of 1, the mask for transmit FIFO interrupt is set which means the interrupt state will be reflected in MIS.TXMIS. A write of 0 clears the mask which means MIS.TXMIS will not reflect the interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_TX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TX" description="Masked Transmit FIFO event" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_TX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TX" description="Set Transmit FIFO event." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="SPI2_DMA_TRIG_TX_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="TX" description="Clear Transmit FIFO event." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
